package a220106;

public class ComparingOpe { //비교연산자 Comparing Operator
	/*
	 * 비교연산자는 두 피연산자를 비교하는데 사용
	 * 
	 * 
	 * [대소비교연산자 < > <= >=]
	 * 
	 * 기본형 중에서는 boolean형을 제외한 나머지 자료형에 다 사용할 수 있지만 참조형에는 사용할 수 없다
	 * 
	 * 
	 * [등가비교연산자 == !=]
	 * 대소비교연산자와 달리 기본형, 참조형 모든 자료형에 사용가능
	 * 
	 *  기본형의 경우 변수에 저장되어 있는 값이 같은지
	 *  참조형의 경우 객체의 memory address(주소값)을 저장하기 때문에 두 개의 피연산자(참조변수)가 같은 객체를 가리키고 있는지 알 수 있다
	 *  
	 *   같냐 다르냐
	 * == 같으면 ture 다르면 false
	 * != 다르면 true 같으면 false
	 * 
	 * = 는 변수에 값 저장
	 * 
	 * 
	 */

}
